Courses/4420/Lectures/SecSoftware/Assertions/practical-advice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Practical Advice on Writing Assertions</title>
<!-- 2018-09-25 Tue 18:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Adv Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Practical Advice on Writing Assertions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Pre- and Post-Conditions</a></li>
<li><a href="#sec-2">2. Loop Invariants</a></li>
<li><a href="#sec-3">3. Class Invariants</a></li>
<li><a href="#sec-4">4. Signatures</a></li>
<li><a href="#sec-5">5. Methods that Alter Globals</a></li>
<li><a href="#sec-6">6. Robustness Tests</a></li>
<li><a href="#sec-7">7. Some Useful Predicates</a></li>
<li><a href="#sec-8">8. End</a></li>
</ul>
</div>
</div>
<p>
An assertion is a logical formula.  It should be written so that if we
"evaluate" it, the resulting value will be either the Boolean True or
False.  And, the evaluation causes no changes in global/local
variables and files.
</p>

<p>
Most assertional facilities will have a way to not compile the
assertions into code executable at run time.  But this is like
discarding a lifeboat while at sea.
</p>

<ol class="org-ol">
<li><a href="./assertions-101.html">./assertions-101.html</a>
</li>
<li><a href="../OODesign/design-by-contract.html">Design by Contract</a>
</li>
<li><a href="./CPP/assertions-cpp.html">Assertions in C/C++</a>
</li>
<li><a href="./Java/assertions-java.html">Assertions in Java</a>
</li>
<li>This article is "more intuitive" than the above.
</li>
</ol>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pre- and Post-Conditions</h2>
<div class="outline-text-2" id="text-1">
<p>
These are assertions.  The syntax of these depends on the programming
language.
</p>

<p>
Pre is placed at the top of a method's body.  It can refer to the values
of parameters and globals.  It should not refer to local variables.
The pre-condition of a method is expected to be true before calling
it.  It is the responsibility of the caller.  The called method can
assume that the pre-condition holds &#x2013; no need to double check it.
</p>

<p>
The post-condition of a method is placed at the bottom of a method's
body.  It is expected to be true before returning to the caller.  If
your method has multiple returns, this should hold at every return.
It can refer to the values of parameters, globals, and local
variables.
</p>

<p>
We use the word "method", as we already did, also as a generic term
for procedures and functions.  As you know, a function is a method
that has no side effects, and returns a value to the caller.
Functions, by this definition, do not alter the values of any global
variables, files, or arguments. Whereas the sole purpose of a
procedure is to have a side-effect.
</p>

<p>
If necessary write additional boolean returning functions whose use is
only within assertions.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Loop Invariants</h2>
<div class="outline-text-2" id="text-2">
<p>
There should be an assertion inserted into every loop that effectively
explains how the loop is accomplishing its goals.  Its location is
your choice.  For a <i>while</i>-loop, it is typically inserted just to the
left of the boolean-exp.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Class Invariants</h2>
<div class="outline-text-2" id="text-3">
<p>
A class invariant describes the values and relationships among all
data members.  A class invariant is both a pre- and a post-condition
for all public methods.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Signatures</h2>
<div class="outline-text-2" id="text-4">
<p>
The signature of a method says quite a bit.  That something is an
integer and such are in the signature, and you should not repeat it in
the pre post conditions.  Learn to write good signatures &#x2013; e.g., if a
parameter is a non-negative integer declare it as unsigned int.
</p>

<p>
When you declare a formal parameter as a value parameter, you are
saying that its value at the end of the method is by itself of no
significance, and the actual argument for it is unchanged.  When you
declare it as a <i>var</i> (or <i>in-out</i>) parameter, you are saying that the
method is expected to change its value as seen by the caller.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Methods that Alter Globals</h2>
<div class="outline-text-2" id="text-5">
<p>
A typical post condition relates the current (about to return) value
of a variable to what it was upon entry to the return.  Whenever this
is so, the easiest universal solution is to introduce a new variable,
e.g., <i>x0</i> for variable <i>x</i>, and immediately upon entry, assign to it
the value of a variable that may change later.
</p>

<p>
Procedures often alter global variables whose names are not passed in
as actual arguments.  The heading of a method in C/C++/Java does not
make clear which globals are accessed and/or modified.  But the
specifications of such procedures should list all such variables, and
describe their values before and after a call to the procedure.
</p>

<p>
Frequently, we have a file that declares many globals.  Not all of
them are manipulated by a method. So, adopt the following
convention. If a post condition is silent regarding a global, we
assume that it is actually asserting that that global <i>is-Unchanged</i> by
that method. Some time a method may not only read but also actually
update the value of global in between but finally leaves its value as
it was upon entry. In this case, silence is unacceptable, and we
should explicitly state that the global is unchanged.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Robustness Tests</h2>
<div class="outline-text-2" id="text-6">
<p>
Consider the following code:<br  />
</p>

<div class="org-src-container">

<pre class="src src-C">int f (T x) {
  int r;
  if (! bexp(x))
        return -1;
  ... more code ...
  ... r is ...
  return r;
}
</pre>
</div>

<p>
This is typical of many functions. Some checking of the given value of
x is made. The function is re-checking its precondition in order to
improve its robustness. If it does not pass this test, i.e., <code>bexp(x)</code>
is false, the method quits.  This is often indicated to the caller by
returning a value that is outside the "legit" values, in this example
a -1. In other examples, you might see a 
<code>panic()</code>
method being called.
</p>

<p>
Q: Is <code>bexp(x)</code> a precondition of <code>f()</code> ?
</p>

<p>
A: No.  The pre-condition of <i>f</i> is True (i.e., nothing at all).
Should you check <i>bexp(x)</i>?  Obviously, it is a pre-condition to the
rest of the code, so you should.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Some Useful Predicates</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>is-defined(v)</code> asserts that a legitimate value from the domain type
of v has been assigned to the variable <code>v</code> after its declaration.
<code>is-undefined(v)</code> is the same as <code>not (V is-defined)</code>.
</p>

<p>
<code>is-unchanged(v)</code> asserts that the variable v is unchanged by this
method.  That its value at the point of return is the same as it was
at the point of entry.
</p>

<p>
<code>is-malloc-returned(p)</code> asserts that the pointer value stored in the
variable <code>p</code> is a value returned by the method <i>malloc</i> or <i>new</i>. 
You can create many other similar predicates by using the names of
other functions in place of malloc.
</p>

<p>
The above predicates are really useful but unfortunately not
predefined.  So even if you have to define them using macros that
unltimately expand them to simply True, do it!
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> End</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2015-10-05
</div>
</body>
</html>
